app/Controllers/Admin/Categories.php

SELECT *
FROM `categories`
---
    public function show_category_user()
    {
        $categoryModel = new CategoryModel();
        $data = $categoryModel->findAll();