app/Controllers/Admin/Product.php

SELECT `products`.*, `images`.`name` as `imagename`, `categories`.`name` as `catname`
FROM `products`
LEFT JOIN `images` ON `products`.`id` = `images`.`product_id`
LEFT JOIN `categories` ON `products`.`category_id` = `categories`.`id`
LEFT JOIN `subcategories` ON `products`.`subcategory_id` = `subcategories`.`id`
ORDER BY `products`.`id` DESC
---
    public function product_show()
    {
        $pmodel = new ProductModel();

        $product = $pmodel->select('products.*, images.name as imagename, categories.name as catname')
            ->join('images', 'products.id = images.product_id', 'left')
            ->join('categories', 'products.category_id = categories.id', 'left')
            ->join('subcategories', 'products.subcategory_id = subcategories.id', 'left')
            ->orderBy('products.id', 'desc')
            ->findAll();